{"type":"data","nodes":[null,null,{"type":"data","data":[{"read":1,"books":16},[2,9],{"id":3,"name":4,"value":5,"valueRendered":6,"dateCreated":7,"dateUpdated":8},2,"currently-reading","I'm currently reading [The Lost Metal by Brandon Sanderson](https:\u002F\u002Fwww.amazon.ca\u002FLost-Metal-Mistborn-Novel\u002Fdp\u002F0765391198), [Thinking in Systems: A Primer by Donella Meadows](https:\u002F\u002Fwww.amazon.ca\u002FThinking-Systems-Primer-Donella-Meadows\u002Fdp\u002F1603580557\u002Fref=asc_df_1603580557\u002F?tag=googleshopc0c-20&linkCode=df0&hvadid=292983223404&hvpos=&hvnetw=g&hvrand=9379528582674499852&hvpone=&hvptwo=&hvqmt=&hvdev=c&hvdvcmdl=&hvlocint=&hvlocphy=9001493&hvtargid=pla-433972195186&psc=1) and [John Dies at the End by David Wong](https:\u002F\u002Fwww.amazon.ca\u002Fgp\u002Fproduct\u002F031255513X)","\u003Cp\u003EI&#39;m currently reading \u003Ca href=\"https:\u002F\u002Fwww.amazon.ca\u002FLost-Metal-Mistborn-Novel\u002Fdp\u002F0765391198\"\u003EThe Lost Metal by Brandon Sanderson\u003C\u002Fa\u003E, \u003Ca href=\"https:\u002F\u002Fwww.amazon.ca\u002FThinking-Systems-Primer-Donella-Meadows\u002Fdp\u002F1603580557\u002Fref=asc_df_1603580557\u002F?tag=googleshopc0c-20&linkCode=df0&hvadid=292983223404&hvpos=&hvnetw=g&hvrand=9379528582674499852&hvpone=&hvptwo=&hvqmt=&hvdev=c&hvdvcmdl=&hvlocint=&hvlocphy=9001493&hvtargid=pla-433972195186&psc=1\"\u003EThinking in Systems: A Primer by Donella Meadows\u003C\u002Fa\u003E and \u003Ca href=\"https:\u002F\u002Fwww.amazon.ca\u002Fgp\u002Fproduct\u002F031255513X\"\u003EJohn Dies at the End by David Wong\u003C\u002Fa\u003E\u003C\u002Fp\u003E\n",["Date","2023-01-02T18:50:53.338Z"],["Date","2023-01-02T18:50:53.336Z"],{"id":10,"name":11,"value":12,"valueRendered":13,"dateCreated":14,"dateUpdated":15},6,"recently-read-2022-intro","Below are some of the books I've read in 2022. Click on a title to read its description. Data was pulled from the Google Books API so the categorization of each book might not be 100% accurate.\n\nIn the future, I'd like to write reviews or short posts discussing each or some of the books. ","\u003Cp\u003EBelow are some of the books I&#39;ve read in 2022. Click on a title to read its description. Data was pulled from the Google Books API so the categorization of each book might not be 100% accurate.\u003C\u002Fp\u003E\n\u003Cp\u003EIn the future, I&#39;d like to write reviews or short posts discussing each or some of the books. \u003C\u002Fp\u003E\n",["Date","2022-12-27T20:20:09.588Z"],["Date","2022-12-27T20:20:09.586Z"],[17,35,52,68,85,100,116,132,149,164,180,196,212,228,244,261,276,293,310,325,341,356,372,388,405,423,439,455,473,489,507],{"id":18,"title":19,"subtitle":20,"description":21,"thumbnail":22,"publishedDate":23,"dateCreated":24,"authors":25,"categories":30},1,"On Writing","A Memoir Of The Craft","Twentieth Anniversary Edition with Contributions from Joe Hill and Owen King ONE OF TIME MAGAZINE’S TOP 100 NONFICTION BOOKS OF ALL TIME Immensely helpful and illuminating to any aspiring writer, this special edition of Stephen King’s critically lauded, million-copy bestseller shares the experiences, habits, and convictions that have shaped him and his work. “Long live the King” hailed Entertainment Weekly upon publication of Stephen King’s On Writing. Part memoir, part master class by one of the bestselling authors of all time, this superb volume is a revealing and practical view of the writer’s craft, comprising the basic tools of the trade every writer must have. King’s advice is grounded in his vivid memories from childhood through his emergence as a writer, from his struggling early career to his widely reported, near-fatal accident in 1999—and how the inextricable link between writing and living spurred his recovery. Brilliantly structured, friendly and inspiring, On Writing will empower and entertain everyone who reads it—fans, writers, and anyone who loves a great story well told.","http:\u002F\u002Fbooks.google.com\u002Fbooks\u002Fcontent?id=MvyTqyff_V4C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",["Date","2000-10-03T00:00:00.000Z"],["Date","2022-12-26T23:25:48.121Z"],[26],{"id":18,"bookId":18,"authorId":18,"author":27},{"id":18,"name":28,"dateCreated":29},"Stephen King",["Date","2022-12-26T23:25:48.113Z"],[31],{"id":18,"bookId":18,"bookCategoryId":18,"bookCategory":32},{"id":18,"category":33,"dateCreated":34},"Language Arts & Disciplines",["Date","2022-12-26T23:25:48.117Z"],{"id":3,"title":36,"subtitle":37,"description":38,"thumbnail":39,"publishedDate":40,"dateCreated":41,"authors":42,"categories":47},"Leviathan Falls",null,"The biggest science fiction series of the decade comes to an incredible conclusion in the ninth and final novel in James S.A. Corey's Hugo-award winning space opera that inspired the Prime Original series. \"An all-time genre classic.\" -Publishers Weekly (starred review) Hugo Award Winner for Best Series The Laconian Empire has fallen, setting the thirteen hundred solar systems free from the rule of Winston Duarte. But the ancient enemy that killed the gate builders is awake, and the war against our universe has begun again. In the dead system of Adro, Elvi Okoye leads a desperate scientific mission to understand what the gate builders were and what destroyed them, even if it means compromising herself and the half-alien children who bear the weight of her investigation. Through the wide-flung systems of humanity, Colonel Aliana Tanaka hunts for Duarte's missing daughter. . . and the shattered emperor himself. And on the Rocinante, James Holden and his crew struggle to build a future for humanity out of the shards and ruins of all that has come before. As nearly unimaginable forces prepare to annihilate all human life, Holden and a group of unlikely allies discover a last, desperate chance to unite all of humanity, with the promise of a vast galactic civilization free from wars, factions, lies, and secrets if they win. But the price of victory may be worse than the cost of defeat. \"Interplanetary adventure the way it ought to be written.\" --George R. R. Martin The Expanse Leviathan Wakes Caliban's War Abaddon's Gate Cibola Burn Nemesis Games Babylon's Ashes Persepolis Rising Tiamat's Wrath ​Leviathan Falls Memory's Legion The Expanse Short Fiction Drive The Butcher of Anderson Station Gods of Risk The Churn The Vital Abyss Strange Dogs Auberon The Sins of Our Fathers","http:\u002F\u002Fbooks.google.com\u002Fbooks\u002Fcontent?id=pvc4zwEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",["Date","2023-02-07T00:00:00.000Z"],["Date","2022-12-26T23:26:00.910Z"],[43],{"id":3,"bookId":3,"authorId":3,"author":44},{"id":3,"name":45,"dateCreated":46},"James S. A. Corey",["Date","2022-12-26T23:26:00.900Z"],[48],{"id":3,"bookId":3,"bookCategoryId":3,"bookCategory":49},{"id":3,"category":50,"dateCreated":51},"Fiction",["Date","2022-12-26T23:26:00.906Z"],{"id":53,"title":54,"subtitle":37,"description":55,"thumbnail":56,"publishedDate":57,"dateCreated":58,"authors":59,"categories":64},3,"The Witching Hour","From the author of the extraordinary Vampire Chronicles comes a huge, hypnotic novel of witchcraft and the occult through four centuries. Demonstrating, once again, her gift for spellbinding storytelling and the creation of legend, Anne Rice makes real for us a great dynasty of witches--a family given to poetry and to incest, to murder and to philosophy; a family that, over the ages, is itself haunted by a powerful, dangerous, and seductive being. On the veranda of a great New Orleans house, now faded, a mute and fragile woman sits rocking . . . and The Witching Hour begins. It begins in our time with a rescue at sea. Rowan Mayfair, a beautiful woman, a brilliant practitioner of neurosurgery--aware that she has special powers but unaware that she comes from an ancient line of witches--finds the drowned body of a man off the coast of California and brings him to life. He is Michael Curry, who was born in New Orleans and orphaned in childhood by fire on Christmas Eve, who pulled himself up from poverty, and who now, in his brief interval of death, has acquired a sensory power that mystifies and frightens him. As these two, fiercely drawn to each other, fall in love and--in passionate alliance--set out to solve the mystery of her past and his unwelcome gift, the novel moves backward and forward in time from today's New Orleans and San Francisco to long-ago Amsterdam and a château in the France of Louis XIV. An intricate tale of evil unfolds--an evil unleashed in seventeenth-century Scotland, where the first \"witch,\" Suzanne of the Mayfair, conjures up the spirit she names Lasher . . . a creation that spells her own destruction and torments each of her descendants in turn. From the coffee plantations of Port au Prince, where the great Mayfair fortune is made and the legacy of their dark power is almost destroyed, to Civil War New Orleans, as Julien--the clan's only male to be endowed with occult powers--provides for the dynasty its foothold in America, the dark, luminous story encompasses dramas of seduction and death, episodes of tenderness and healing. And always--through peril and escape, tension and release--there swirl around us the echoes of eternal war: innocence versus the corruption of the spirit, sanity against madness, life against death. With a dreamlike power, the novel draws us, through circuitous, twilight paths, to the present and Rowan's increasingly inspired and risky moves in the merciless game that binds her to her heritage. And in New Orleans, on Christmas Eve, this strangest of family sagas is brought to its startling climax.","http:\u002F\u002Fbooks.google.com\u002Fbooks\u002Fcontent?id=hFT7yV3zAeUC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",["Date","2010-11-17T00:00:00.000Z"],["Date","2022-12-26T23:26:18.159Z"],[60],{"id":53,"bookId":53,"authorId":53,"author":61},{"id":53,"name":62,"dateCreated":63},"Anne Rice",["Date","2022-12-26T23:26:18.150Z"],[65],{"id":53,"bookId":53,"bookCategoryId":3,"bookCategory":66},{"id":3,"category":50,"dateCreated":67},["Date","2022-12-26T23:26:00.906Z"],{"id":69,"title":70,"subtitle":71,"description":72,"thumbnail":73,"publishedDate":74,"dateCreated":75,"authors":76,"categories":81},4,"The Song of Achilles","A Novel","“At once a scholar’s homage to The Iliad and startlingly original work of art by an incredibly talented new novelist….A book I could not put down.” —Ann Patchett “Mary Renault lives again!” declares Emma Donoghue, author of Room, referring to The Song of Achilles, Madeline Miller’s thrilling, profoundly moving, and utterly unique retelling of the legend of Achilles and the Trojan War. A tale of gods, kings, immortal fame, and the human heart, The Song of Achilles is a dazzling literary feat that brilliantly reimagines Homer’s enduring masterwork, The Iliad. An action-packed adventure, an epic love story, a marvelously conceived and executed page-turner, Miller’s monumental debut novel has already earned resounding acclaim from some of contemporary fiction’s brightest lights—and fans of Mary Renault, Bernard Cornwell, Steven Pressfield, and Colleen McCullough’s Masters of Rome series will delight in this unforgettable journey back to ancient Greece in the Age of Heroes.","http:\u002F\u002Fbooks.google.com\u002Fbooks\u002Fcontent?id=opC3d3ltQ94C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",["Date","2012-03-06T00:00:00.000Z"],["Date","2022-12-26T23:26:30.987Z"],[77],{"id":69,"bookId":69,"authorId":69,"author":78},{"id":69,"name":79,"dateCreated":80},"Madeline Miller",["Date","2022-12-26T23:26:30.978Z"],[82],{"id":69,"bookId":69,"bookCategoryId":3,"bookCategory":83},{"id":3,"category":50,"dateCreated":84},["Date","2022-12-26T23:26:00.906Z"],{"id":86,"title":87,"subtitle":37,"description":88,"thumbnail":89,"publishedDate":90,"dateCreated":91,"authors":92,"categories":96},5,"Circe","\"A bold and subversive retelling of the goddess's story,\" this #1 New York Times bestseller is \"both epic and intimate in its scope, recasting the most infamous female figure from the Odyssey as a hero in her own right\" (Alexandra Alter, The New York Times). In the house of Helios, god of the sun and mightiest of the Titans, a daughter is born. But Circe is a strange child -- not powerful, like her father, nor viciously alluring like her mother. Turning to the world of mortals for companionship, she discovers that she does possess power -- the power of witchcraft, which can transform rivals into monsters and menace the gods themselves. Threatened, Zeus banishes her to a deserted island, where she hones her occult craft, tames wild beasts and crosses paths with many of the most famous figures in all of mythology, including the Minotaur, Daedalus and his doomed son Icarus, the murderous Medea, and, of course, wily Odysseus. But there is danger, too, for a woman who stands alone, and Circe unwittingly draws the wrath of both men and gods, ultimately finding herself pitted against one of the most terrifying and vengeful of the Olympians. To protect what she loves most, Circe must summon all her strength and choose, once and for all, whether she belongs with the gods she is born from, or the mortals she has come to love. With unforgettably vivid characters, mesmerizing language, and page-turning suspense, Circe is a triumph of storytelling, an intoxicating epic of family rivalry, palace intrigue, love and loss, as well as a celebration of indomitable female strength in a man's world. #1 New York Times Bestseller -- named one of the Best Books of the Year by NPR, the Washington Post, People, Time, Amazon, Entertainment Weekly, Bustle, Newsweek, the A.V. Club, Christian Science Monitor, Refinery 29, Buzzfeed, Paste, Audible, Kirkus, Publishers Weekly, Thrillist, NYPL, Self, Real Simple, Goodreads, Boston Globe, Electric Literature, BookPage, the Guardian, Book Riot, Seattle Times, and Business Insider.","http:\u002F\u002Fbooks.google.com\u002Fbooks\u002Fcontent?id=Vu8vDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",["Date","2018-04-10T00:00:00.000Z"],["Date","2022-12-26T23:26:42.765Z"],[93],{"id":86,"bookId":86,"authorId":69,"author":94},{"id":69,"name":79,"dateCreated":95},["Date","2022-12-26T23:26:30.978Z"],[97],{"id":86,"bookId":86,"bookCategoryId":3,"bookCategory":98},{"id":3,"category":50,"dateCreated":99},["Date","2022-12-26T23:26:00.906Z"],{"id":10,"title":101,"subtitle":37,"description":102,"thumbnail":103,"publishedDate":104,"dateCreated":105,"authors":106,"categories":111},"Cytonic","NEW YORK TIMES BESTSELLER • The third book in an epic series about a girl who will travel beyond the stars to save the world she loves from destruction from the author of the Reckoners series, the Mistborn trilogy, and the Stormlight Archive. Spensa’s life as a Defiant Defense Force pilot has been far from ordinary. She proved herself one of the best starfighters in the human enclave of Detritus and she saved her people from extermination at the hands of the Krell—the enigmatic alien species that has been holding them captive for decades. What’s more, she traveled light-years from home as an undercover spy to infiltrate the Superiority, where she learned of the galaxy beyond her small, desolate planet home. Now, the Superiority—the governing galactic alliance bent on dominating all human life—has started a galaxy-wide war. And Spensa’s seen the weapons they plan to use to end it: the Delvers. Ancient, mysterious alien forces that can wipe out entire planetary systems in an instant. Spensa knows that no matter how many pilots the DDF has, there is no defeating this predator. Except that Spensa is Cytonic. She faced down a Delver and saw something eerily familiar about it. And maybe, if she’s able to figure out what she is, she could be more than just another pilot in this unfolding war. She could save the galaxy. The only way she can discover what she really is, though, is to leave behind all she knows and enter the Nowhere. A place from which few ever return. To have courage means facing fear. And this mission is terrifying.","http:\u002F\u002Fbooks.google.com\u002Fbooks\u002Fcontent?id=_U1KEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",["Date","2021-11-23T00:00:00.000Z"],["Date","2022-12-26T23:26:51.717Z"],[107],{"id":10,"bookId":10,"authorId":86,"author":108},{"id":86,"name":109,"dateCreated":110},"Brandon Sanderson",["Date","2022-12-26T23:26:51.706Z"],[112],{"id":10,"bookId":10,"bookCategoryId":53,"bookCategory":113},{"id":53,"category":114,"dateCreated":115},"Young Adult Fiction",["Date","2022-12-26T23:26:51.713Z"],{"id":117,"title":118,"subtitle":37,"description":119,"thumbnail":120,"publishedDate":121,"dateCreated":122,"authors":123,"categories":128},7,"The Good House","Working to rebuild her law practice after her son commits suicide, Angela Toussaint journeys to the family home where the suicide took place, hoping for answers, and discovers an invisible, evil force that is driving locals to acts of violence. Reprint.","http:\u002F\u002Fbooks.google.com\u002Fbooks\u002Fcontent?id=62tLnSyQLTAC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",["Date","2006-01-01T00:00:00.000Z"],["Date","2022-12-26T23:27:01.917Z"],[124],{"id":117,"bookId":117,"authorId":10,"author":125},{"id":10,"name":126,"dateCreated":127},"Tananarive Due",["Date","2022-12-26T23:27:01.906Z"],[129],{"id":117,"bookId":117,"bookCategoryId":3,"bookCategory":130},{"id":3,"category":50,"dateCreated":131},["Date","2022-12-26T23:26:00.906Z"],{"id":133,"title":134,"subtitle":135,"description":136,"thumbnail":137,"publishedDate":138,"dateCreated":139,"authors":140,"categories":145},8,"Bird by Bird","Some Instructions on Writing and Life","From the acclaimed New York Times bestselling author: An essential volume for generations of writers young and old. The twenty-fifth anniversary edition of this modern classic will continue to spark creative minds for years to come. For a quarter century, more than a million readers—scribes and scribblers of all ages and abilities—have been inspired by Anne Lamott’s hilarious, big-hearted, homespun advice. Advice that begins with the simple words of wisdom passed down from Anne’s father—also a writer—in the iconic passage that gives the book its title: “Thirty years ago my older brother, who was ten years old at the time, was trying to get a report on birds written that he’d had three months to write. It was due the next day. We were out at our family cabin in Bolinas, and he was at the kitchen table close to tears, surrounded by binder paper and pencils and unopened books on birds, immobilized by the hugeness of the task ahead. Then my father sat down beside him, put his arm around my brother’s shoulder, and said, ‘Bird by bird, buddy. Just take it bird by bird.’”","http:\u002F\u002Fbooks.google.com\u002Fbooks\u002Fcontent?id=dwfGvtzvte4C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",["Date","2007-12-18T00:00:00.000Z"],["Date","2022-12-26T23:27:10.657Z"],[141],{"id":133,"bookId":133,"authorId":117,"author":142},{"id":117,"name":143,"dateCreated":144},"Anne Lamott",["Date","2022-12-26T23:27:10.648Z"],[146],{"id":133,"bookId":133,"bookCategoryId":18,"bookCategory":147},{"id":18,"category":33,"dateCreated":148},["Date","2022-12-26T23:25:48.117Z"],{"id":150,"title":151,"subtitle":37,"description":152,"thumbnail":153,"publishedDate":154,"dateCreated":155,"authors":156,"categories":160},9,"Lasher","\"SEDUCTIVE MAGIC...SPELLBINDING...Rice stages her scenes in a wide variety of times and locales, tapping deeply into the richest veins of mythology and history.\" --San Francisco Chronicle \"STEAMY...FAST-PACED AND HUGELY ENGROSSING...Rice's title character--a seductive, evil, highly sexual and ultimately tragic creature--is fascinating.\" --The Miami Herald \"BEHIND ALL THE VELVET DRAPES AND GOSSAMER WINDING SHEETS, THIS IS AN OLD-FASHIONED FAMILY SAGA....Rice's descriptive writing is so opulent it almost begs to be read by candlelight.\" --The Washington Post Book World \"RICE SEES THINGS ON A GRAND SCALE...There is a wide-screen historical sweep to the tale as it moves from one generation of witches to the other.\" --The Boston Globe \"EROTIC...EERIE...HORRIFYING...A tight tale of the occult in present-day New Orleans...Anne Rice is a spellbinding novelist.... LASHER quenches.\" --Denver Post A MAIN SELECTION OF THE LITERARY GUILD(c)","http:\u002F\u002Fbooks.google.com\u002Fbooks\u002Fcontent?id=nDN1WF2RauoC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",["Date","2010-11-17T00:00:00.000Z"],["Date","2022-12-26T23:27:23.151Z"],[157],{"id":150,"bookId":150,"authorId":53,"author":158},{"id":53,"name":62,"dateCreated":159},["Date","2022-12-26T23:26:18.150Z"],[161],{"id":150,"bookId":150,"bookCategoryId":3,"bookCategory":162},{"id":3,"category":50,"dateCreated":163},["Date","2022-12-26T23:26:00.906Z"],{"id":165,"title":166,"subtitle":37,"description":167,"thumbnail":168,"publishedDate":169,"dateCreated":170,"authors":171,"categories":176},10,"The Impossible Girl","Two hearts. Twice as vulnerable. Manhattan, 1850. Born out of wedlock to a wealthy socialite and a nameless immigrant, Cora Lee can mingle with the rich just as easily as she can slip unnoticed into the slums and graveyards of the city. As the only female resurrectionist in New York, she's carved out a niche procuring bodies afflicted with the strangest of anomalies. Anatomists will pay exorbitant sums for such specimens--dissecting and displaying them for the eager public. Cora's specialty is not only profitable, it's a means to keep a finger on the pulse of those searching for her. She's the girl born with two hearts--a legend among grave robbers and anatomists--sought after as an endangered prize. Now, as a series of murders unfolds closer and closer to Cora, she can no longer trust those she holds dear, including the young medical student she's fallen for. Because someone has no intention of waiting for Cora to die a natural death.","http:\u002F\u002Fbooks.google.com\u002Fbooks\u002Fcontent?id=63r3tAEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",["Date","2018-09-18T00:00:00.000Z"],["Date","2022-12-26T23:27:31.159Z"],[172],{"id":165,"bookId":165,"authorId":133,"author":173},{"id":133,"name":174,"dateCreated":175},"Lydia Kang",["Date","2022-12-26T23:27:31.150Z"],[177],{"id":165,"bookId":165,"bookCategoryId":3,"bookCategory":178},{"id":3,"category":50,"dateCreated":179},["Date","2022-12-26T23:26:00.906Z"],{"id":181,"title":182,"subtitle":37,"description":183,"thumbnail":184,"publishedDate":185,"dateCreated":186,"authors":187,"categories":192},11,"Norse Mythology","“Remarkable.… Gaiman has provided an enchanting contemporary interpretation of the Viking ethos.”—Lisa L. Hannett, Atlantic Neil Gaiman, long inspired by ancient mythology in creating the fantastical realms of his fiction, presents a bravura rendition of the Norse gods and their world from their origin though their upheaval in Ragnarok. In Norse Mythology, Gaiman stays true to the myths in envisioning the major Norse pantheon: Odin, the highest of the high, wise, daring, and cunning; Thor, Odin’s son, incredibly strong yet not the wisest of gods; and Loki—son of a giant—blood brother to Odin and a trickster and unsurpassable manipulator. Gaiman fashions these primeval stories into a novelistic arc that begins with the genesis of the legendary nine worlds and delves into the exploits of deities, dwarfs, and giants. Through Gaiman’s deft and witty prose, these gods emerge with their fiercely competitive natures, their susceptibility to being duped and to duping others, and their tendency to let passion ignite their actions, making these long-ago myths breathe pungent life again.","http:\u002F\u002Fbooks.google.com\u002Fbooks\u002Fcontent?id=ft2NDAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",["Date","2017-02-07T00:00:00.000Z"],["Date","2022-12-26T23:27:38.898Z"],[188],{"id":181,"bookId":181,"authorId":150,"author":189},{"id":150,"name":190,"dateCreated":191},"Neil Gaiman",["Date","2022-12-26T23:27:38.889Z"],[193],{"id":181,"bookId":181,"bookCategoryId":3,"bookCategory":194},{"id":3,"category":50,"dateCreated":195},["Date","2022-12-26T23:26:00.906Z"],{"id":197,"title":198,"subtitle":37,"description":199,"thumbnail":200,"publishedDate":201,"dateCreated":202,"authors":203,"categories":208},12,"The Innocent Mage","\"The Innocent Mage is come, and we stand at the beginning of the end of everything.\" Being a fisherman like his father isn't a bad life, but it's not the one that Asher wants. Despite his humble roots, Asher has grand dreams. And they call him to Dorana, home of princes, beggars?and the warrior mages who have protected the kingdom for generations. Little does Asher know, however, that his arrival in the city is being closely watched by members of the Circle, people dedicated to preserving an ancient magic. Asher might have come to the city to make his fortune, but he will find his destiny.","http:\u002F\u002Fbooks.google.com\u002Fbooks\u002Fcontent?id=fRavxPlf7KIC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",["Date","2011-12-01T00:00:00.000Z"],["Date","2022-12-26T23:27:47.145Z"],[204],{"id":197,"bookId":197,"authorId":165,"author":205},{"id":165,"name":206,"dateCreated":207},"Karen Miller",["Date","2022-12-26T23:27:47.136Z"],[209],{"id":197,"bookId":197,"bookCategoryId":3,"bookCategory":210},{"id":3,"category":50,"dateCreated":211},["Date","2022-12-26T23:26:00.906Z"],{"id":213,"title":214,"subtitle":37,"description":215,"thumbnail":216,"publishedDate":217,"dateCreated":218,"authors":219,"categories":223},13,"The Awakened Mage","In this follow-up to \"The Innocent Mage,\" Miller concludes her Kingmaker, Kingbreaker duology. Asher has come a long way for a fishermans son. Now that the evil mage Morg is preparing for his most deadly assault, Asher unwittingly falls into a dangerous deception. Original.","http:\u002F\u002Fbooks.google.com\u002Fbooks\u002Fcontent?id=VECxoQEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",["Date","2014-06-12T00:00:00.000Z"],["Date","2022-12-26T23:27:57.103Z"],[220],{"id":213,"bookId":213,"authorId":165,"author":221},{"id":165,"name":206,"dateCreated":222},["Date","2022-12-26T23:27:47.136Z"],[224],{"id":213,"bookId":213,"bookCategoryId":69,"bookCategory":225},{"id":69,"category":226,"dateCreated":227},"FICTION",["Date","2022-12-26T23:27:57.096Z"],{"id":229,"title":230,"subtitle":231,"description":232,"thumbnail":233,"publishedDate":234,"dateCreated":235,"authors":236,"categories":240},14,"Ghost Summer","Stories","Tananarive Due, a winner of the American Book Award and an Essence and Los Angeles Times bestselling author, brings you her debut short fiction collection! The title novella, Ghost Summer, won a Kindred Award from the Carl Brandon Society (originally published in The Ancestors). This collection includes Patient Zero, The Lake, The Knowing, Herd Immunity, and many other stories.","http:\u002F\u002Fbooks.google.com\u002Fbooks\u002Fcontent?id=OfEMrgEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",["Date","2015-06-16T00:00:00.000Z"],["Date","2022-12-26T23:28:05.083Z"],[237],{"id":229,"bookId":229,"authorId":10,"author":238},{"id":10,"name":126,"dateCreated":239},["Date","2022-12-26T23:27:01.906Z"],[241],{"id":229,"bookId":229,"bookCategoryId":3,"bookCategory":242},{"id":3,"category":50,"dateCreated":243},["Date","2022-12-26T23:26:00.906Z"],{"id":245,"title":246,"subtitle":247,"description":248,"thumbnail":249,"publishedDate":250,"dateCreated":251,"authors":252,"categories":257},15,"Lord of the Flies","New Educational Edition","A plane crashes on a desert island and the only survivors, a group of schoolboys, assemble on the beach and wait to be rescued. By day they inhabit a land of bright fantastic birds and dark blue seas, but at night their dreams are haunted by the image of a terrifying beast. As the boys' delicate sense of order fades, so their childish dreams are transformed into something more primitive, and their behaviour starts to take on a murderous, savage significance. First published in 1954, Lord of the Flies is one of the most celebrated and widely read of modern classics. Now fully revised and updated, this educational edition includes chapter summaries, comprehension questions, discussion points, classroom activities, a biographical profile of Golding, historical context relevant to the novel and an essay on Lord of the Flies by William Golding entitled 'Fable'. Aimed at Key Stage 3 and 4 students, it also includes a section on literary theory for advanced or A-level students. The educational edition encourages original and independent thinking while guiding the student through the text - ideal for use in the classroom and at home.","http:\u002F\u002Fbooks.google.com\u002Fbooks\u002Fcontent?id=DKU1EsmnpMQC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",["Date","2012-09-20T00:00:00.000Z"],["Date","2022-12-26T23:28:40.499Z"],[253],{"id":245,"bookId":245,"authorId":181,"author":254},{"id":181,"name":255,"dateCreated":256},"William Golding",["Date","2022-12-26T23:28:40.490Z"],[258],{"id":245,"bookId":245,"bookCategoryId":3,"bookCategory":259},{"id":3,"category":50,"dateCreated":260},["Date","2022-12-26T23:26:00.906Z"],{"id":262,"title":263,"subtitle":37,"description":264,"thumbnail":265,"publishedDate":266,"dateCreated":267,"authors":268,"categories":272},16,"The Tommyknockers","Roberta Anderson, while searching for firewood in the forest, stumbles upon a buried ship and with the help of her onetime lover, Jim Gardener, excavates an artifact that changes the townspeople of Haven.","http:\u002F\u002Fbooks.google.com\u002Fbooks\u002Fcontent?id=yWiMCwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",["Date","2016-02-16T00:00:00.000Z"],["Date","2022-12-26T23:28:55.211Z"],[269],{"id":262,"bookId":262,"authorId":18,"author":270},{"id":18,"name":28,"dateCreated":271},["Date","2022-12-26T23:25:48.113Z"],[273],{"id":262,"bookId":262,"bookCategoryId":3,"bookCategory":274},{"id":3,"category":50,"dateCreated":275},["Date","2022-12-26T23:26:00.906Z"],{"id":277,"title":278,"subtitle":37,"description":279,"thumbnail":280,"publishedDate":281,"dateCreated":282,"authors":283,"categories":288},17,"Thinking, Fast and Slow","NEW YORK TIMES BESTSELLER The guru to the gurus at last shares his knowledge with the rest of us. Nobel laureate Daniel Kahneman's seminal studies in behavioral psychology, behavioral economics, and happiness studies have influenced numerous other authors, including Steven Pinker and Malcolm Gladwell. In Thinking, Fast and Slow, Kahneman at last offers his own, first book for the general public. It is a lucid and enlightening summary of his life's work. It will change the way you think about thinking. Two systems drive the way we think and make choices, Kahneman explains: System One is fast, intuitive, and emotional; System Two is slower, more deliberative, and more logical. Examining how both systems function within the mind, Kahneman exposes the extraordinary capabilities as well as the biases of fast thinking and the pervasive influence of intuitive impressions on our thoughts and our choices. Engaging the reader in a lively conversation about how we think, he shows where we can trust our intuitions and how we can tap into the benefits of slow thinking, contrasting the two-system view of the mind with the standard model of the rational economic agent. Kahneman's singularly influential work has transformed cognitive psychology and launched the new fields of behavioral economics and happiness studies. In this path-breaking book, Kahneman shows how the mind works, and offers practical and enlightening insights into how choices are made in both our business and personal lives--and how we can guard against the mental glitches that often get us into trouble.","http:\u002F\u002Fbooks.google.com\u002Fbooks\u002Fcontent?id=TA7Q27RWlj0C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",["Date","2011-11-01T00:00:00.000Z"],["Date","2022-12-26T23:29:05.131Z"],[284],{"id":277,"bookId":277,"authorId":197,"author":285},{"id":197,"name":286,"dateCreated":287},"Daniel Kahneman",["Date","2022-12-26T23:29:05.121Z"],[289],{"id":277,"bookId":277,"bookCategoryId":86,"bookCategory":290},{"id":86,"category":291,"dateCreated":292},"Psychology",["Date","2022-12-26T23:29:05.127Z"],{"id":294,"title":295,"subtitle":37,"description":296,"thumbnail":297,"publishedDate":298,"dateCreated":299,"authors":300,"categories":305},18,"Ghost Story","It began shortly after the party at which one of their members, Edward Wanderley, had died - or was killed. The Chowder Society, who for years had met in customary evening dress with the object of telling each other tales of every kind, now found themselves drawn towards the supernatural. It was some sort of solace for Edward's loss. They began to tell ghost stories, extraordinary ghost stories ... ghost stories that did not always stop when the teller finished speaking ... Then came the dreams, shared simultaneously by the Chowder Society members, forecasting horrors the four ageing men can scarcely bring themselves to discuss. And now they are about to learn what happens to those who believe they can bury the past - and get away with murder.","http:\u002F\u002Fbooks.google.com\u002Fbooks\u002Fcontent?id=XMFjPgAACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",["Date","2008-08-01T00:00:00.000Z"],["Date","2022-12-26T23:29:19.352Z"],[301],{"id":294,"bookId":294,"authorId":213,"author":302},{"id":213,"name":303,"dateCreated":304},"Peter Straub",["Date","2022-12-26T23:29:19.342Z"],[306],{"id":294,"bookId":294,"bookCategoryId":10,"bookCategory":307},{"id":10,"category":308,"dateCreated":309},"Ghost stories",["Date","2022-12-26T23:29:19.348Z"],{"id":311,"title":312,"subtitle":37,"description":313,"thumbnail":314,"publishedDate":315,"dateCreated":316,"authors":317,"categories":321},19,"Taltos","When Ashlar learns that another Taltos has been seen, he is suddenly propelled into the haunting world of the Mayfair family, the New Orleans dynasty of witches forever besieged by ghosts, spirits, and their own dizzying powers. For Ashlar knows this powerful clan is intimately linked to the heritage of the Taltos. In a swirling universe filled with death and life, corruption and innocence, this mesmerizing novel takes us on a wondrous journey back through the centuries to a civilization half-human, of wholly mysterious origin, at odds with mortality and immortality, justice and guilt. It is an enchanted, hypnotic world that could only come from the imagination of Anne Rice . . . Praise for Taltos “Taltos is the third book in a series known as the lives of the Mayfair witches. . .Their haunted heritage has brought the family great wealth, which is exercised from a New Orleans manse with Southern gentility; but of course such power cannot escape notice . . . or challenge . . . Rice is a formidable talent. . . . [Taltos] is a curious amalgam of gothic, glamour fiction, alternate history, and high soap opera.”—The Washington Post Book World “Anne Rice will live on through the ages of literature.”—San Francisco Chronicle “An intricate, stunning imagination.”—Los Angeles Times Book Review “Spellbinding . . . mythical . . . Anne Rice is a pure storyteller.”—Cosmopolitan “Beautifully written.”—Kirkus Reivews (starred review) “Her power of invention seems boundless. . . . She has made a masterpiece of the morbid, worthy of Poe’s daughter. . . . It is hard to praise sufficiently the originality of Miss Rice.”—The Wall Street Journal","http:\u002F\u002Fbooks.google.com\u002Fbooks\u002Fcontent?id=zeWODQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",["Date","1996-03-31T00:00:00.000Z"],["Date","2022-12-26T23:29:27.090Z"],[318],{"id":311,"bookId":311,"authorId":53,"author":319},{"id":53,"name":62,"dateCreated":320},["Date","2022-12-26T23:26:18.150Z"],[322],{"id":311,"bookId":311,"bookCategoryId":3,"bookCategory":323},{"id":3,"category":50,"dateCreated":324},["Date","2022-12-26T23:26:00.906Z"],{"id":326,"title":327,"subtitle":71,"description":328,"thumbnail":329,"publishedDate":330,"dateCreated":331,"authors":332,"categories":337},20,"Confessions of the Fox","A New York Times Editors’ Choice: “A mind-bending romp through a gender-fluid, eighteenth century London . . . a joyous mash-up of literary genres shot through with queer theory and awash in sex, crime, and revolution.” NAMED ONE OF THE BEST BOOKS OF THE YEAR BY The New Yorker • HuffPost • Kirkus Reviews • Finalist for the Lambda Literary Award • Shortlisted for the Center for Fiction First Novel Prize • “A dazzling tale of queer romance and resistance.”—Time Jack Sheppard and Edgeworth Bess were the most notorious thieves, jailbreakers, and lovers of eighteenth-century London. Yet no one knows the true story; their confessions have never been found. Until now. Reeling from heartbreak, a scholar named Dr. Voth discovers a long-lost manuscript—a gender-defying exposé of Jack and Bess’s adventures. Is Confessions of the Fox an authentic autobiography or a hoax? As Dr. Voth is drawn deeper into Jack and Bess’s tale of underworld resistance and gender transformation, it becomes clear that their fates are intertwined—and only a miracle will save them all. Writing with the narrative mastery of Sarah Waters and the playful imagination of Nabokov, Jordy Rosenberg is an audacious storyteller of extraordinary talent. Praise for Confessions of the Fox “A cunning metafiction of vulpine versatility . . . an action-adventure tale with postmodern flourishes; an academic comedy spliced with period erotica; an intimate meditation on belonging.”—Katy Waldman, The New Yorker “Confessions of the Fox is so goddamned good. Reading it was like an out-of-body experience. I want to run through the streets screaming about it. It should be in the personal canon of every queer and non-cis person. Read it.”—Carmen Maria Machado, National Book Award finalist for Her Body and Other Parties “A hat tip to Moby-Dick . . . a running footnote hall of mirrors to rival Borges . . . one of the most trenchant calls for progressive action that I have read in a very long time.”—The New York Times Book Review “An ambitious work of metafiction, a sexy queer love story . . . a bold first novel.”—Entertainment Weekly","http:\u002F\u002Fbooks.google.com\u002Fbooks\u002Fcontent?id=Zg03DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",["Date","2018-06-26T00:00:00.000Z"],["Date","2022-12-26T23:29:38.713Z"],[333],{"id":326,"bookId":326,"authorId":229,"author":334},{"id":229,"name":335,"dateCreated":336},"Jordy Rosenberg",["Date","2022-12-26T23:29:38.700Z"],[338],{"id":326,"bookId":326,"bookCategoryId":3,"bookCategory":339},{"id":3,"category":50,"dateCreated":340},["Date","2022-12-26T23:26:00.906Z"],{"id":342,"title":343,"subtitle":37,"description":344,"thumbnail":345,"publishedDate":346,"dateCreated":347,"authors":348,"categories":352},21,"Dreamcatcher","In Derry, Maine, four young boys once stood together and did a brave thing. Something that changed them in ways they hardly understand. A quarter of a century later, the boys are men who have gone their separate ways. Though they still get together once a year, to go hunting in the north woods of Maine. But this time is different. This time a man comes stumbling into their camp, lost, disoriented and muttering about lights in the sky. Before long, these old friends will be plunged into the most remarkable events of their lives as they struggle with a terrible creature from another world. Their only chance of survival is locked in their shared past - and in the Dreamcatcher.","http:\u002F\u002Fbooks.google.com\u002Fbooks\u002Fcontent?id=tECJkgAACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",["Date","2011-01-01T00:00:00.000Z"],["Date","2022-12-26T23:30:02.489Z"],[349],{"id":342,"bookId":342,"authorId":18,"author":350},{"id":18,"name":28,"dateCreated":351},["Date","2022-12-26T23:25:48.113Z"],[353],{"id":342,"bookId":342,"bookCategoryId":3,"bookCategory":354},{"id":3,"category":50,"dateCreated":355},["Date","2022-12-26T23:26:00.906Z"],{"id":357,"title":358,"subtitle":71,"description":359,"thumbnail":360,"publishedDate":361,"dateCreated":362,"authors":363,"categories":368},22,"Sole Survivor","A catastrophic, unexplainable plane crash leaves three hundred and thirty dead -- no survivors. Among the victims are the wife and two daughters of Joe Carpenter, a Los Angeles Post crime reporter. A year after the crash, still gripped by an almost paralyzing grief, Joe encounters a woman named Rose, who claims to have survived the crash. She holds out the possibility of a secret that will bring Joe peace of mind. But before he can ask any questions, she slips away. Driven now by rage (have the authorities withheld information?) and a hope almost as unbearable as his grief (if there is one survivor, are there others?), Joe sets out to find the mysterious woman. His search immediately leads him into the path of a powerful and shadowy organization hell-bent on stopping Rose before she can reveal what she knows about the crash. Sole Survivor unfolds at a heart-stopping pace, as a desperate chase and a shattering emotional odyssey lead Joe to a truth that will force him to reassess everything he thought he knew about life and death -- a truth that, given the chance, will rock the world and redefine the destiny of humanity. BONUS: This edition contains an excerpt from Dean Koontz's The City.","http:\u002F\u002Fbooks.google.com\u002Fbooks\u002Fcontent?id=DORXBDUdGgcC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",["Date","2007-06-29T00:00:00.000Z"],["Date","2022-12-26T23:30:09.354Z"],[364],{"id":357,"bookId":357,"authorId":245,"author":365},{"id":245,"name":366,"dateCreated":367},"Dean Koontz",["Date","2022-12-26T23:30:09.345Z"],[369],{"id":357,"bookId":357,"bookCategoryId":3,"bookCategory":370},{"id":3,"category":50,"dateCreated":371},["Date","2022-12-26T23:26:00.906Z"],{"id":373,"title":374,"subtitle":37,"description":375,"thumbnail":376,"publishedDate":377,"dateCreated":378,"authors":379,"categories":384},23,"The First Fifteen Lives of Harry August","SOME STORIES CANNOT BE TOLD IN JUST ONE LIFETIME. Harry August is on his deathbed. Again. No matter what he does or the decisions he makes, when death comes, Harry always returns to where he began, a child with all the knowledge of a life he has already lived a dozen times before. Nothing ever changes. Until now. As Harry nears the end of his eleventh life, a little girl appears at his bedside. \"I nearly missed you, Doctor August,\" she says. \"I need to send a message.\" This is the story of what Harry does next, and what he did before, and how he tries to save a past he cannot change and a future he cannot allow.","http:\u002F\u002Fbooks.google.com\u002Fbooks\u002Fcontent?id=Wm9pngEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",["Date","2014-10-21T00:00:00.000Z"],["Date","2022-12-26T23:30:18.058Z"],[380],{"id":373,"bookId":373,"authorId":262,"author":381},{"id":262,"name":382,"dateCreated":383},"Claire North",["Date","2022-12-26T23:30:18.049Z"],[385],{"id":373,"bookId":373,"bookCategoryId":3,"bookCategory":386},{"id":3,"category":50,"dateCreated":387},["Date","2022-12-26T23:26:00.906Z"],{"id":389,"title":390,"subtitle":391,"description":392,"thumbnail":393,"publishedDate":394,"dateCreated":395,"authors":396,"categories":401},24,"Save the Cat! Writes a Novel","The Last Book On Novel Writing You'll Ever Need","The first novel-writing guide from the best-selling Save the Cat! story-structure series, which reveals the 15 essential plot points needed to make any novel a success. Novelist Jessica Brody presents a comprehensive story-structure guide for novelists that applies the famed Save the Cat! screenwriting methodology to the world of novel writing. Revealing the 15 \"beats\" (plot points) that comprise a successful story--from the opening image to the finale--this book lays out the Ten Story Genres (Monster in the House; Whydunit; Dude with a Problem) alongside quirky, original insights (Save the Cat; Shard of Glass) to help novelists craft a plot that will captivate--and a novel that will sell.","http:\u002F\u002Fbooks.google.com\u002Fbooks\u002Fcontent?id=ivhtDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",["Date","2018-10-09T00:00:00.000Z"],["Date","2022-12-26T23:30:25.544Z"],[397],{"id":389,"bookId":389,"authorId":277,"author":398},{"id":277,"name":399,"dateCreated":400},"Jessica Brody",["Date","2022-12-26T23:30:25.535Z"],[402],{"id":389,"bookId":389,"bookCategoryId":18,"bookCategory":403},{"id":18,"category":33,"dateCreated":404},["Date","2022-12-26T23:25:48.117Z"],{"id":406,"title":407,"subtitle":408,"description":409,"thumbnail":410,"publishedDate":411,"dateCreated":412,"authors":413,"categories":418},25,"Dark Money","The Hidden History of the Billionaires Behind the Rise of the Radical Right","NATIONAL BESTSELLER ONE OF THE NEW YORK TIMES 10 BEST BOOKS OF THE YEAR Who are the immensely wealthy right-wing ideologues shaping the fate of America today? From the bestselling author of The Dark Side, an electrifying work of investigative journalism that uncovers the agenda of this powerful group. In her new preface, Jane Mayer discusses the results of the most recent election and Donald Trump's victory, and how, despite much discussion to the contrary, this was a huge victory for the billionaires who have been pouring money in the American political system. Why is America living in an age of profound and widening economic inequality? Why have even modest attempts to address climate change been defeated again and again? Why do hedge-fund billionaires pay a far lower tax rate than middle-class workers? In a riveting and indelible feat of reporting, Jane Mayer illuminates the history of an elite cadre of plutocrats—headed by the Kochs, the Scaifes, the Olins, and the Bradleys—who have bankrolled a systematic plan to fundamentally alter the American political system. Mayer traces a byzantine trail of billions of dollars spent by the network, revealing a staggering conglomeration of think tanks, academic institutions, media groups, courthouses, and government allies that have fallen under their sphere of influence. Drawing from hundreds of exclusive interviews, as well as extensive scrutiny of public records, private papers, and court proceedings, Mayer provides vivid portraits of the secretive figures behind the new American oligarchy and a searing look at the carefully concealed agendas steering the nation. Dark Money is an essential book for anyone who cares about the future of American democracy. National Book Critics Circle Award Finalist LA Times Book Prize Finalist PEN\u002FJean Stein Book Award Finalist Shortlisted for the Lukas Prize","http:\u002F\u002Fbooks.google.com\u002Fbooks\u002Fcontent?id=GDf4DQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",["Date","2017-01-24T00:00:00.000Z"],["Date","2022-12-26T23:30:35.631Z"],[414],{"id":406,"bookId":406,"authorId":294,"author":415},{"id":294,"name":416,"dateCreated":417},"Jane Mayer",["Date","2022-12-26T23:30:35.619Z"],[419],{"id":406,"bookId":406,"bookCategoryId":117,"bookCategory":420},{"id":117,"category":421,"dateCreated":422},"Political Science",["Date","2022-12-26T23:30:35.627Z"],{"id":424,"title":425,"subtitle":37,"description":426,"thumbnail":427,"publishedDate":428,"dateCreated":429,"authors":430,"categories":435},26,"1Q84","NATIONAL BESTSELLER • The year is 1984 and the city is Tokyo. A young woman named Aomame follows a taxi driver’s enigmatic suggestion and begins to notice puzzling discrepancies in the world around her. She has entered, she realizes, a parallel existence, which she calls 1Q84 —“Q is for ‘question mark.’ A world that bears a question.” Meanwhile, an aspiring writer named Tengo takes on a suspect ghostwriting project. He becomes so wrapped up with the work and its unusual author that, soon, his previously placid life begins to come unraveled. As Aomame’s and Tengo’s narratives converge over the course of this single year, we learn of the profound and tangled connections that bind them ever closer: a beautiful, dyslexic teenage girl with a unique vision; a mysterious religious cult that instigated a shoot-out with the metropolitan police; a reclusive, wealthy dowager who runs a shelter for abused women; a hideously ugly private investigator; a mild-mannered yet ruthlessly efficient bodyguard; and a peculiarly insistent television-fee collector. A love story, a mystery, a fantasy, a novel of self-discovery, a dystopia to rival George Orwell’s—1Q84 is Haruki Murakami’s most ambitious undertaking yet: an instant best seller in his native Japan, and a tremendous feat of imagination from one of our most revered contemporary writers.","http:\u002F\u002Fbooks.google.com\u002Fbooks\u002Fcontent?id=CPPxMXgaKhAC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",["Date","2011-10-25T00:00:00.000Z"],["Date","2022-12-26T23:30:47.335Z"],[431],{"id":424,"bookId":424,"authorId":311,"author":432},{"id":311,"name":433,"dateCreated":434},"Haruki Murakami",["Date","2022-12-26T23:30:47.325Z"],[436],{"id":424,"bookId":424,"bookCategoryId":3,"bookCategory":437},{"id":3,"category":50,"dateCreated":438},["Date","2022-12-26T23:26:00.906Z"],{"id":440,"title":441,"subtitle":71,"description":442,"thumbnail":443,"publishedDate":444,"dateCreated":445,"authors":446,"categories":451},27,"The Grace Year","The Instant New York Times Bestseller! A speculative thriller in the vein of The Handmaid’s Tale and The Power. Optioned by Universal and Elizabeth Banks to be a major motion picture! “A visceral, darkly haunting fever dream of a novel and an absolute page-turner. Liggett’s deeply suspenseful book brilliantly explores the high cost of a misogynistic world that denies women power and does it with a heart-in-your-throat, action-driven story that’s equal parts horror-laden fairy tale, survival story, romance, and resistance manifesto. I couldn’t stop reading.” – Libba Bray, New York Times bestselling author Survive the year. No one speaks of the grace year. It’s forbidden. In Garner County, girls are told they have the power to lure grown men from their beds, to drive women mad with jealousy. They believe their very skin emits a powerful aphrodisiac, the potent essence of youth, of a girl on the edge of womanhood. That’s why they’re banished for their sixteenth year, to release their magic into the wild so they can return purified and ready for marriage. But not all of them will make it home alive. Sixteen-year-old Tierney James dreams of a better life—a society that doesn’t pit friend against friend or woman against woman, but as her own grace year draws near, she quickly realizes that it’s not just the brutal elements they must fear. It’s not even the poachers in the woods, men who are waiting for a chance to grab one of the girls in order to make a fortune on the black market. Their greatest threat may very well be each other. With sharp prose and gritty realism, The Grace Year examines the complex and sometimes twisted relationships between girls, the women they eventually become, and the difficult decisions they make in-between.","http:\u002F\u002Fbooks.google.com\u002Fbooks\u002Fcontent?id=i0mDDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",["Date","2019-10-08T00:00:00.000Z"],["Date","2022-12-26T23:30:55.965Z"],[447],{"id":440,"bookId":440,"authorId":326,"author":448},{"id":326,"name":449,"dateCreated":450},"Kim Liggett",["Date","2022-12-26T23:30:55.953Z"],[452],{"id":440,"bookId":440,"bookCategoryId":53,"bookCategory":453},{"id":53,"category":114,"dateCreated":454},["Date","2022-12-26T23:26:51.713Z"],{"id":456,"title":457,"subtitle":458,"description":459,"thumbnail":460,"publishedDate":461,"dateCreated":462,"authors":463,"categories":468},28,"Cribsheet","A Data-Driven Guide to Better, More Relaxed Parenting, from Birth to Preschool","Parenting is full of decisions, nearly all of which can be agonized over. There is an abundance of often-conflicting advice hurled at you from doctors, family, friends, and strangers on the internet. But the benefits of these choices can be overstated, and the trade-offs can be profound. How do you make your own best decision? Armed with the data, Oster finds that the conventional wisdom doesn't always hold up. She debunks myths and offers non-judgemental ways to consider our options in light of the facts. She also shows parents how to think through freighted questions like if and how to go back to work, how to think about toddler discipline, and how to have a relationship and parent at the same time. Cribsheet is a thinking parent's guide that empowers us to make better, less fraught decisions - and stay sane in the years before preschool.","http:\u002F\u002Fbooks.google.com\u002Fbooks\u002Fcontent?id=ba-RyQEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",["Date","2020-04-02T00:00:00.000Z"],["Date","2022-12-26T23:31:02.461Z"],[464],{"id":456,"bookId":456,"authorId":342,"author":465},{"id":342,"name":466,"dateCreated":467},"Emily Oster",["Date","2022-12-26T23:31:02.446Z"],[469],{"id":456,"bookId":456,"bookCategoryId":133,"bookCategory":470},{"id":133,"category":471,"dateCreated":472},"Parenting",["Date","2022-12-26T23:31:02.454Z"],{"id":474,"title":475,"subtitle":37,"description":476,"thumbnail":477,"publishedDate":478,"dateCreated":479,"authors":480,"categories":485},29,"Snow Crash","\"This Snow Crash thing--is it a virus, a drug, or a religion?\" Juanita shrugs. \"What's the difference?\" The only relief from the sea of logos is within the well-guarded borders of the Burbclaves. Is it any wonder that most sane folks have forsaken the real world and chosen to live in the computer-generated universe of virtual reality? In a major city, the size of a dozen Manhattans, is a domain of pleasures limited only by the imagination. But now a strange new computer virus called Snow Crash is striking down hackers everywhere, leaving an unlikely young pizza delivery man as humankind's last best hope. The perfect cyberpunk sci-fi read, Snow Crash is an equally worthy successor to William Gibson's Neuromancer and predecessor to Ernest Cline's Ready Player One. *** What readers are saying about Snow Crash: 'It's hard to believe Neal wrote his books when the published date claims. He's always so right about the future, and I keep on hoping he's so wrong' Goodreads Reader Review 'Snow Crash is to Books as The Matrix is to movies (with only the absolute BEST parts of Tron and Da Vinci Code thrown in)' Goodreads Reader Review 'Loved it! Can't recommend it highly enough. Everyone should read this book. Go do it. Do it now. It's just awesome. You won't regret it' Goodreads Reader Review 'It's hilarious and mind-blowing. From the first page to the last, I was amazed at just how much influence this book has had on TV, movies, etc.' Goodreads Reader Review","http:\u002F\u002Fbooks.google.com\u002Fbooks\u002Fcontent?id=inYs79gV4UQC&printsec=frontcover&img=1&zoom=1&source=gbs_api",["Date","1994-10-27T00:00:00.000Z"],["Date","2022-12-26T23:31:17.850Z"],[481],{"id":474,"bookId":474,"authorId":357,"author":482},{"id":357,"name":483,"dateCreated":484},"Neal Stephenson",["Date","2022-12-26T23:31:17.839Z"],[486],{"id":474,"bookId":474,"bookCategoryId":3,"bookCategory":487},{"id":3,"category":50,"dateCreated":488},["Date","2022-12-26T23:26:00.906Z"],{"id":490,"title":491,"subtitle":492,"description":493,"thumbnail":494,"publishedDate":495,"dateCreated":496,"authors":497,"categories":502},31,"A Mind for Numbers","How to Excel at Math and Science (Even If You Flunked Algebra)","An engineering professor who started out doing poorly in mathematical and technical subjects in school offers tools, tips and techniques to learning the creative and analytical thought processes that will lead to achievement in math and science. Original.","http:\u002F\u002Fbooks.google.com\u002Fbooks\u002Fcontent?id=Jv3YCwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",["Date","2014-07-31T00:00:00.000Z"],["Date","2022-12-28T20:58:39.598Z"],[498],{"id":490,"bookId":490,"authorId":373,"author":499},{"id":373,"name":500,"dateCreated":501},"Barbara A. Oakley",["Date","2022-12-28T20:58:39.588Z"],[503],{"id":490,"bookId":490,"bookCategoryId":150,"bookCategory":504},{"id":150,"category":505,"dateCreated":506},"Business & Economics",["Date","2022-12-28T20:58:39.593Z"],{"id":508,"title":509,"subtitle":37,"description":510,"thumbnail":511,"publishedDate":512,"dateCreated":513,"authors":514,"categories":519},32,"The City We Became","Every great city has a soul. Some are ancient as myths; others are as new and destructive as children. New York? She's got six - and all six will be called to arms in the greatest battle the city has ever fought.","http:\u002F\u002Fbooks.google.com\u002Fbooks\u002Fcontent?id=1I1qzQEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",["Date","2021-07-27T00:00:00.000Z"],["Date","2022-07-01T18:42:19.719Z"],[515],{"id":508,"bookId":508,"authorId":389,"author":516},{"id":389,"name":517,"dateCreated":518},"N. K. Jemisin",["Date","2023-01-02T18:42:19.713Z"],[520],{"id":508,"bookId":508,"bookCategoryId":3,"bookCategory":521},{"id":3,"category":50,"dateCreated":522},["Date","2022-12-26T23:26:00.906Z"]],"uses":{}}]}