{"type":"data","nodes":[null,null,{"type":"data","data":[{"books":1,"read":72},[2,22,37,55],{"id":3,"title":4,"subtitle":5,"description":6,"thumbnail":7,"publishedDate":8,"dateCreated":9,"authors":10,"categories":16},33,"The Bands of Mourning","A Mistborn Novel","From #1 New York Times bestselling author Brandon Sanderson, the Mistborn series is a heist story of political intrigue and magical, martial-arts action.Three hundred years after the events of the Mistborn trilogy, Scadrial is now on the verge of modernity, with railroads to supplement the canals, electric lighting in the streets and the homes of the wealthy, and the first steel-framed skyscrapers racing for the clouds.The Bands of Mourning are the mythical metal minds owned by the Lord Ruler, said to grant anyone who wears them the powers that the Lord Ruler had at his command. Hardly anyone thinks they really exist. A kandra researcher has returned to Elendel with images that seem to depict the Bands, as well as writings in a language that no one can read. Waxillium Ladrian is recruited to travel south to the city of New Seran to investigate. Along the way he discovers hints that point to the true goals of his uncle Edwarn and the shadowy organization known as The Set.Other Tor books by Brandon Sanderson The Cosmere The Stormlight Archive The Way of Kings Words of Radiance Edgedancer (Novella) Oathbringer Dawnshard (Novella) Rhythm of War The Mistborn trilogy Mistborn: The Final Empire The Well of Ascension The Hero of Ages Mistborn: The Wax and Wayne series Alloy of Law Shadows of Self Bands of Mourning The Lost Metal Collection Arcanum Unbounded Other Cosmere novels Elantris Warbreaker The Alcatraz vs. the Evil Librarians series Alcatraz vs. the Evil Librarians The Scrivener's Bones The Knights of Crystallia The Shattered Lens The Dark Talent The Rithmatist series The Rithmatist Other books by Brandon Sanderson The Reckoners Steelheart Firefight Calamity","http:\u002F\u002Fbooks.google.com\u002Fbooks\u002Fcontent?id=sYtVEAAAQBAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",["Date","2023-09-05T00:00:00.000Z"],["Date","2023-01-02T18:47:13.053Z"],[11],{"id":3,"bookId":3,"authorId":12,"author":13},5,{"id":12,"name":14,"dateCreated":15},"Brandon Sanderson",["Date","2022-12-26T23:26:51.706Z"],[17],{"id":3,"bookId":3,"bookCategoryId":18,"bookCategory":19},2,{"id":18,"category":20,"dateCreated":21},"Fiction",["Date","2022-12-26T23:26:00.906Z"],{"id":23,"title":24,"subtitle":5,"description":25,"thumbnail":26,"publishedDate":27,"dateCreated":28,"authors":29,"categories":33},34,"The Lost Metal","For years, frontier lawman turned big-city senator Waxillium Ladrian has hunted the shadowy organization the Set―with his late uncle and his sister among their leaders―since they started kidnapping people with the power of Allomancy in their bloodlines. When Detective Marasi Colms and her partner Wayne find stockpiled weapons bound for the Outer City of Bilming, this opens a new lead. Conflict between Elendel and the Outer Cities only favors the Set, and their tendrils now reach to the Elendel Senate―whose corruption Wax and Steris have sought to expose―and Bilming is even more entangled. After Wax discovers a new type of explosive that can unleash unprecedented destruction and realizes that the Set must already have it, an immortal kandra serving Scadrial’s god, Harmony, reveals that Bilming has fallen under the influence of another god: Trell, worshipped by the Set. And Trell isn’t the only factor at play from the larger Cosmere―Marasi is recruited by offworlders with strange abilities who claim their goal is to protect Scadrial...at any cost. Wax must choose whether to set aside his rocky relationship with God and once again become the Sword that Harmony has groomed him to be. If no one steps forward to be the hero Scadrial needs, the planet and its millions of people will come to a sudden and calamitous ruin.--Amazon","http:\u002F\u002Fbooks.google.com\u002Fbooks\u002Fcontent?id=PjtTEAAAQBAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",["Date","2022-11-15T00:00:00.000Z"],["Date","2023-01-12T21:14:23.591Z"],[30],{"id":23,"bookId":23,"authorId":12,"author":31},{"id":12,"name":14,"dateCreated":32},["Date","2022-12-26T23:26:51.706Z"],[34],{"id":23,"bookId":23,"bookCategoryId":18,"bookCategory":35},{"id":18,"category":20,"dateCreated":36},["Date","2022-12-26T23:26:00.906Z"],{"id":38,"title":39,"subtitle":40,"description":41,"thumbnail":42,"publishedDate":43,"dateCreated":44,"authors":45,"categories":51},35,"John Dies at the End",null,"My name is David Wong. My best friend is John. Those names are fake. You might want to change yours. You may not want to know about the things you'll read on these pages, about the sauce, about Korrock, about the invasion, and the future. But it's too late. You touched the book. You're in the game. You're under the eye. The only defence is knowledge. You need to read this book, to the end. Even the part about the bratwurst. Why? You'll just have to trust me. Unfortunately for us, if you make the right choice, we'll have a much harder time explaining how to fight off the otherwordly invasion currently threatening to enslave humanity. I'm sorry to have involved you in this, I really am. But as you read about these terrible events and the very dark epoch the world is about to enter as a result, it is crucial you keep one thing in mind: NONE OF THIS IS MY FAULT...","http:\u002F\u002Fbooks.google.com\u002Fbooks\u002Fcontent?id=Gni_BgAAQBAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",["Date","2011-09-08T00:00:00.000Z"],["Date","2023-01-12T21:14:47.117Z"],[46],{"id":38,"bookId":38,"authorId":47,"author":48},25,{"id":47,"name":49,"dateCreated":50},"David Wong",["Date","2023-01-12T21:14:47.108Z"],[52],{"id":38,"bookId":38,"bookCategoryId":18,"bookCategory":53},{"id":18,"category":20,"dateCreated":54},["Date","2022-12-26T23:26:00.906Z"],{"id":56,"title":57,"subtitle":40,"description":58,"thumbnail":59,"publishedDate":60,"dateCreated":61,"authors":62,"categories":68},36,"The Elementals","Something terrifying waits in the decaying Victorian house on the coast, something that has haunted two men since they were children, something that may be ready to kill...again.","http:\u002F\u002Fbooks.google.com\u002Fbooks\u002Fcontent?id=z7SHoAEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",["Date","2014-06-17T00:00:00.000Z"],["Date","2023-01-16T00:34:27.815Z"],[63],{"id":56,"bookId":56,"authorId":64,"author":65},26,{"id":64,"name":66,"dateCreated":67},"Michael McDowell",["Date","2023-01-16T00:34:27.808Z"],[69],{"id":56,"bookId":56,"bookCategoryId":18,"bookCategory":70},{"id":18,"category":20,"dateCreated":71},["Date","2022-12-26T23:26:00.906Z"],[73,79],{"id":18,"name":74,"value":75,"valueRendered":76,"dateCreated":77,"dateUpdated":78},"currently-reading","I'm currently reading [Tress and the Emerald Sea by Brandon Sanderson](https:\u002F\u002Fwww.amazon.com\u002FTress-Emerald-Sea-Brandon-Sanderson\u002Fdp\u002F1250899656) and [Thinking in Systems: A Primer by Donella Meadows](https:\u002F\u002Fwww.amazon.ca\u002FThinking-Systems-Primer-Donella-Meadows\u002Fdp\u002F1603580557\u002Fref=asc_df_1603580557\u002F?tag=googleshopc0c-20&linkCode=df0&hvadid=292983223404&hvpos=&hvnetw=g&hvrand=9379528582674499852&hvpone=&hvptwo=&hvqmt=&hvdev=c&hvdvcmdl=&hvlocint=&hvlocphy=9001493&hvtargid=pla-433972195186&psc=1)","\u003Cp\u003EI&#39;m currently reading \u003Ca href=\"https:\u002F\u002Fwww.amazon.com\u002FTress-Emerald-Sea-Brandon-Sanderson\u002Fdp\u002F1250899656\"\u003ETress and the Emerald Sea by Brandon Sanderson\u003C\u002Fa\u003E and \u003Ca href=\"https:\u002F\u002Fwww.amazon.ca\u002FThinking-Systems-Primer-Donella-Meadows\u002Fdp\u002F1603580557\u002Fref=asc_df_1603580557\u002F?tag=googleshopc0c-20&linkCode=df0&hvadid=292983223404&hvpos=&hvnetw=g&hvrand=9379528582674499852&hvpone=&hvptwo=&hvqmt=&hvdev=c&hvdvcmdl=&hvlocint=&hvlocphy=9001493&hvtargid=pla-433972195186&psc=1\"\u003EThinking in Systems: A Primer by Donella Meadows\u003C\u002Fa\u003E\u003C\u002Fp\u003E\n",["Date","2023-01-16T00:34:56.066Z"],["Date","2023-01-16T00:34:56.064Z"],{"id":80,"name":81,"value":82,"valueRendered":83,"dateCreated":84,"dateUpdated":85},6,"recently-read-2022-intro","Below are some of the books I've read this year. Click on a title to read its description. Data was pulled from the Google Books API so the categorization of each book might not be 100% accurate.\n\nIn the future, I'd like to write reviews or short posts discussing each or some of the books. ","\u003Cp\u003EBelow are some of the books I&#39;ve read this year. Click on a title to read its description. Data was pulled from the Google Books API so the categorization of each book might not be 100% accurate.\u003C\u002Fp\u003E\n\u003Cp\u003EIn the future, I&#39;d like to write reviews or short posts discussing each or some of the books. \u003C\u002Fp\u003E\n",["Date","2023-01-15T07:33:03.265Z"],["Date","2023-01-15T07:33:03.264Z"]],"uses":{"params":["year"]}}]}