{"type":"data","nodes":[null,null,{"type":"data","data":[{"books":1,"read":192},[2,22,37,55,72,89,107,124,140,157,175],{"id":3,"title":4,"subtitle":5,"description":6,"thumbnail":7,"publishedDate":8,"dateCreated":9,"authors":10,"categories":16},33,"The Bands of Mourning","A Mistborn Novel","From #1 New York Times bestselling author Brandon Sanderson, the Mistborn series is a heist story of political intrigue and magical, martial-arts action.Three hundred years after the events of the Mistborn trilogy, Scadrial is now on the verge of modernity, with railroads to supplement the canals, electric lighting in the streets and the homes of the wealthy, and the first steel-framed skyscrapers racing for the clouds.The Bands of Mourning are the mythical metal minds owned by the Lord Ruler, said to grant anyone who wears them the powers that the Lord Ruler had at his command. Hardly anyone thinks they really exist. A kandra researcher has returned to Elendel with images that seem to depict the Bands, as well as writings in a language that no one can read. Waxillium Ladrian is recruited to travel south to the city of New Seran to investigate. Along the way he discovers hints that point to the true goals of his uncle Edwarn and the shadowy organization known as The Set.Other Tor books by Brandon Sanderson The Cosmere The Stormlight Archive The Way of Kings Words of Radiance Edgedancer (Novella) Oathbringer Dawnshard (Novella) Rhythm of War The Mistborn trilogy Mistborn: The Final Empire The Well of Ascension The Hero of Ages Mistborn: The Wax and Wayne series Alloy of Law Shadows of Self Bands of Mourning The Lost Metal Collection Arcanum Unbounded Other Cosmere novels Elantris Warbreaker The Alcatraz vs. the Evil Librarians series Alcatraz vs. the Evil Librarians The Scrivener's Bones The Knights of Crystallia The Shattered Lens The Dark Talent The Rithmatist series The Rithmatist Other books by Brandon Sanderson The Reckoners Steelheart Firefight Calamity","http:\u002F\u002Fbooks.google.com\u002Fbooks\u002Fcontent?id=sYtVEAAAQBAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",["Date","2023-09-05T00:00:00.000Z"],["Date","2023-01-02T18:47:13.053Z"],[11],{"id":3,"bookId":3,"authorId":12,"author":13},5,{"id":12,"name":14,"dateCreated":15},"Brandon Sanderson",["Date","2022-12-26T23:26:51.706Z"],[17],{"id":3,"bookId":3,"bookCategoryId":18,"bookCategory":19},2,{"id":18,"category":20,"dateCreated":21},"Fiction",["Date","2022-12-26T23:26:00.906Z"],{"id":23,"title":24,"subtitle":5,"description":25,"thumbnail":26,"publishedDate":27,"dateCreated":28,"authors":29,"categories":33},34,"The Lost Metal","For years, frontier lawman turned big-city senator Waxillium Ladrian has hunted the shadowy organization the Set―with his late uncle and his sister among their leaders―since they started kidnapping people with the power of Allomancy in their bloodlines. When Detective Marasi Colms and her partner Wayne find stockpiled weapons bound for the Outer City of Bilming, this opens a new lead. Conflict between Elendel and the Outer Cities only favors the Set, and their tendrils now reach to the Elendel Senate―whose corruption Wax and Steris have sought to expose―and Bilming is even more entangled. After Wax discovers a new type of explosive that can unleash unprecedented destruction and realizes that the Set must already have it, an immortal kandra serving Scadrial’s god, Harmony, reveals that Bilming has fallen under the influence of another god: Trell, worshipped by the Set. And Trell isn’t the only factor at play from the larger Cosmere―Marasi is recruited by offworlders with strange abilities who claim their goal is to protect Scadrial...at any cost. Wax must choose whether to set aside his rocky relationship with God and once again become the Sword that Harmony has groomed him to be. If no one steps forward to be the hero Scadrial needs, the planet and its millions of people will come to a sudden and calamitous ruin.--Amazon","http:\u002F\u002Fbooks.google.com\u002Fbooks\u002Fcontent?id=PjtTEAAAQBAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",["Date","2022-11-15T00:00:00.000Z"],["Date","2023-01-12T21:14:23.591Z"],[30],{"id":23,"bookId":23,"authorId":12,"author":31},{"id":12,"name":14,"dateCreated":32},["Date","2022-12-26T23:26:51.706Z"],[34],{"id":23,"bookId":23,"bookCategoryId":18,"bookCategory":35},{"id":18,"category":20,"dateCreated":36},["Date","2022-12-26T23:26:00.906Z"],{"id":38,"title":39,"subtitle":40,"description":41,"thumbnail":42,"publishedDate":43,"dateCreated":44,"authors":45,"categories":51},35,"John Dies at the End",null,"My name is David Wong. My best friend is John. Those names are fake. You might want to change yours. You may not want to know about the things you'll read on these pages, about the sauce, about Korrock, about the invasion, and the future. But it's too late. You touched the book. You're in the game. You're under the eye. The only defence is knowledge. You need to read this book, to the end. Even the part about the bratwurst. Why? You'll just have to trust me. Unfortunately for us, if you make the right choice, we'll have a much harder time explaining how to fight off the otherwordly invasion currently threatening to enslave humanity. I'm sorry to have involved you in this, I really am. But as you read about these terrible events and the very dark epoch the world is about to enter as a result, it is crucial you keep one thing in mind: NONE OF THIS IS MY FAULT...","http:\u002F\u002Fbooks.google.com\u002Fbooks\u002Fcontent?id=Gni_BgAAQBAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",["Date","2011-09-08T00:00:00.000Z"],["Date","2023-01-12T21:14:47.117Z"],[46],{"id":38,"bookId":38,"authorId":47,"author":48},25,{"id":47,"name":49,"dateCreated":50},"David Wong",["Date","2023-01-12T21:14:47.108Z"],[52],{"id":38,"bookId":38,"bookCategoryId":18,"bookCategory":53},{"id":18,"category":20,"dateCreated":54},["Date","2022-12-26T23:26:00.906Z"],{"id":56,"title":57,"subtitle":40,"description":58,"thumbnail":59,"publishedDate":60,"dateCreated":61,"authors":62,"categories":68},36,"The Elementals","Something terrifying waits in the decaying Victorian house on the coast, something that has haunted two men since they were children, something that may be ready to kill...again.","http:\u002F\u002Fbooks.google.com\u002Fbooks\u002Fcontent?id=z7SHoAEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",["Date","2014-06-17T00:00:00.000Z"],["Date","2023-01-16T00:34:27.815Z"],[63],{"id":56,"bookId":56,"authorId":64,"author":65},26,{"id":64,"name":66,"dateCreated":67},"Michael McDowell",["Date","2023-01-16T00:34:27.808Z"],[69],{"id":56,"bookId":56,"bookCategoryId":18,"bookCategory":70},{"id":18,"category":20,"dateCreated":71},["Date","2022-12-26T23:26:00.906Z"],{"id":73,"title":74,"subtitle":40,"description":75,"thumbnail":76,"publishedDate":77,"dateCreated":78,"authors":79,"categories":85},37,"And Then She Vanished","He only looked away for a second. Still haunted by the disappearance of his little sister, Amy, over twenty years ago, Joseph Bridgeman’s life has fallen apart. When a friend talks him into seeing hypnotherapist Alexia Finch to help with his insomnia, Joseph accidentally discovers he can time travel. His first trip only takes him back a few minutes, but his new-found ability gives him something he hasn’t felt for the longest time: hope. Joseph sets out to travel back to the night Amy went missing and save her. But after several failed attempts, he discovers the farther back he travels, the less time he gets to stay there. And the clock is ticking. With the help of Alexia, Joseph embarks on a desperate race against the past to save his sister. Can he master his new skill and solve the mystery of Amy’s disappearance before it’s too late? Previously released as The Unexpected Gift of Joseph Bridgeman, this updated version includes extra chapters, new plotlines, and even deeper character development. It makes way for an expanded vision of the Joseph Bridgeman Series, with the first four books released in 2021 and 2022.","http:\u002F\u002Fbooks.google.com\u002Fbooks\u002Fcontent?id=agz4DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",["Date","2021-02-02T00:00:00.000Z"],["Date","2023-01-20T19:36:17.405Z"],[80],{"id":73,"bookId":73,"authorId":81,"author":82},27,{"id":81,"name":83,"dateCreated":84},"Nick Jones",["Date","2023-01-20T19:36:17.397Z"],[86],{"id":73,"bookId":73,"bookCategoryId":18,"bookCategory":87},{"id":18,"category":20,"dateCreated":88},["Date","2022-12-26T23:26:00.906Z"],{"id":90,"title":91,"subtitle":92,"description":93,"thumbnail":94,"publishedDate":95,"dateCreated":96,"authors":97,"categories":103},38,"A Man Called Ove","A Novel","A curmudgeon hides a terrible personal loss beneath a cranky and short-tempered exterior while clashing with new neighbors, a boisterous family whose chattiness and habits lead to unexpected friendship.","http:\u002F\u002Fbooks.google.com\u002Fbooks\u002Fcontent?id=Y0H6AwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",["Date","2014-07-15T00:00:00.000Z"],["Date","2023-02-01T00:31:55.178Z"],[98],{"id":90,"bookId":90,"authorId":99,"author":100},28,{"id":99,"name":101,"dateCreated":102},"Fredrik Backman",["Date","2023-02-01T00:31:55.166Z"],[104],{"id":90,"bookId":90,"bookCategoryId":18,"bookCategory":105},{"id":18,"category":20,"dateCreated":106},["Date","2022-12-26T23:26:00.906Z"],{"id":108,"title":109,"subtitle":40,"description":110,"thumbnail":111,"publishedDate":112,"dateCreated":113,"authors":114,"categories":120},39,"Fairy Tale","A #1 New York Times Bestseller and New York Times Book Review Editors' Choice! Legendary storyteller Stephen King goes into the deepest well of his imagination in this spellbinding novel about a seventeen-year-old boy who inherits the keys to a parallel world where good and evil are at war, and the stakes could not be higher—for that world or ours. Charlie Reade looks like a regular high school kid, great at baseball and football, a decent student. But he carries a heavy load. His mom was killed in a hit-and-run accident when he was seven, and grief drove his dad to drink. Charlie learned how to take care of himself—and his dad. When Charlie is seventeen, he meets a dog named Radar and her aging master, Howard Bowditch, a recluse in a big house at the top of a big hill, with a locked shed in the backyard. Sometimes strange sounds emerge from it. Charlie starts doing jobs for Mr. Bowditch and loses his heart to Radar. Then, when Bowditch dies, he leaves Charlie a cassette tape telling a story no one would believe. What Bowditch knows, and has kept secret all his long life, is that inside the shed is a portal to another world. King’s storytelling in Fairy Tale soars. This is a magnificent and terrifying tale in which good is pitted against overwhelming evil, and a heroic boy—and his dog—must lead the battle. Early in the Pandemic, King asked himself: “What could you write that would make you happy?” “As if my imagination had been waiting for the question to be asked, I saw a vast deserted city—deserted but alive. I saw the empty streets, the haunted buildings, a gargoyle head lying overturned in the street. I saw smashed statues (of what I didn’t know, but I eventually found out). I saw a huge, sprawling palace with glass towers so high their tips pierced the clouds. Those images released the story I wanted to tell.”","http:\u002F\u002Fbooks.google.com\u002Fbooks\u002Fcontent?id=-GFaEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",["Date","2022-09-06T00:00:00.000Z"],["Date","2023-02-01T18:52:11.040Z"],[115],{"id":108,"bookId":108,"authorId":116,"author":117},1,{"id":116,"name":118,"dateCreated":119},"Stephen King",["Date","2022-12-26T23:25:48.113Z"],[121],{"id":108,"bookId":108,"bookCategoryId":18,"bookCategory":122},{"id":18,"category":20,"dateCreated":123},["Date","2022-12-26T23:26:00.906Z"],{"id":125,"title":126,"subtitle":127,"description":128,"thumbnail":129,"publishedDate":130,"dateCreated":131,"authors":132,"categories":136},40,"Tress of the Emerald Sea","A Cosmere Novel","#1 New York Times bestselling author Brandon Sanderson expands his Cosmere universe shared by The Stormlight Archive and Mistborn with a new standalone novel for everyone who loved The Princess Bride. The only life Tress has known on her island home in an emerald-green ocean has been a simple one, with the simple pleasures of collecting cups brought by sailors from faraway lands and listening to stories told by her friend Charlie. But when his father takes him on a voyage to find a bride and disaster strikes, Tress must stow away on a ship and seek the Sorceress of the deadly Midnight Sea. Amid the spore oceans where pirates abound, can Tress leave her simple life behind and make her own place sailing a sea where a single drop of water can mean instant death? Note from Brandon: I started writing this in secret, as a novel just for my wife. She urged me to share it with the world—and alongside three other secret novels, with the support of readers worldwide it grew into the biggest Kickstarter campaign of all time. I’m excited to present this first book to you at last: a different type of Brandon Sanderson story, one I wrote when there were no time constraints, no expectations, and no limits on my imagination. Come be part of the magic.","http:\u002F\u002Fbooks.google.com\u002Fbooks\u002Fcontent?id=EzSiEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",["Date","2023-01-10T00:00:00.000Z"],["Date","2023-03-03T06:28:23.424Z"],[133],{"id":125,"bookId":125,"authorId":12,"author":134},{"id":12,"name":14,"dateCreated":135},["Date","2022-12-26T23:26:51.706Z"],[137],{"id":125,"bookId":125,"bookCategoryId":18,"bookCategory":138},{"id":18,"category":20,"dateCreated":139},["Date","2022-12-26T23:26:00.906Z"],{"id":141,"title":142,"subtitle":40,"description":143,"thumbnail":144,"publishedDate":145,"dateCreated":146,"authors":147,"categories":153},41,"Nothing to See Here","A New York Times Bestseller • A Read with Jenna Today Show Book Club Pick! Named a Best Book of the Year by The New York Times Book Review, The Washington Post, People, Entertainment Weekly, USA Today, TIME, The A.V. Club, Buzzfeed, and PopSugar “I can’t believe how good this book is.... It’s wholly original. It’s also perfect.... Wilson writes with such a light touch.... The brilliance of the novel [is] that it distracts you with these weirdo characters and mesmerizing and funny sentences and then hits you in a way you didn’t see coming. You’re laughing so hard you don’t even realize that you’ve suddenly caught fire.” —Taffy Brodesser-Akner, author of Fleishman is in Trouble, New York Times Book Review From the New York Times bestselling author of The Family Fang, a moving and uproarious novel about a woman who finds meaning in her life when she begins caring for two children with a remarkable ability. Lillian and Madison were unlikely roommates and yet inseparable friends at their elite boarding school. But then Lillian had to leave the school unexpectedly in the wake of a scandal and they’ve barely spoken since. Until now, when Lillian gets a letter from Madison pleading for her help. Madison’s twin stepkids are moving in with her family and she wants Lillian to be their caretaker. However, there’s a catch: the twins spontaneously combust when they get agitated, flames igniting from their skin in a startling but beautiful way. Lillian is convinced Madison is pulling her leg, but it’s the truth. Thinking of her dead-end life at home, the life that has consistently disappointed her, Lillian figures she has nothing to lose. Over the course of one humid, demanding summer, Lillian and the twins learn to trust each other—and stay cool—while also staying out of the way of Madison’s buttoned-up politician husband. Surprised by her own ingenuity yet unused to the intense feelings of protectiveness she feels for them, Lillian ultimately begins to accept that she needs these strange children as much as they need her—urgently and fiercely. Couldn’t this be the start of the amazing life she’d always hoped for? With white-hot wit and a big, tender heart, Kevin Wilson has written his best book yet—a most unusual story of parental love.","http:\u002F\u002Fbooks.google.com\u002Fbooks\u002Fcontent?id=M0CGDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",["Date","2019-10-29T00:00:00.000Z"],["Date","2023-03-03T06:29:01.676Z"],[148],{"id":141,"bookId":141,"authorId":149,"author":150},29,{"id":149,"name":151,"dateCreated":152},"Kevin Wilson",["Date","2023-03-03T06:29:01.658Z"],[154],{"id":141,"bookId":141,"bookCategoryId":18,"bookCategory":155},{"id":18,"category":20,"dateCreated":156},["Date","2022-12-26T23:26:00.906Z"],{"id":158,"title":159,"subtitle":160,"description":161,"thumbnail":162,"publishedDate":163,"dateCreated":164,"authors":165,"categories":171},42,"2001","A Space Odyssey","Two astronauts find their journey into space and their very lives jeopardized by the jealousy of an extraordinary computer named Hal","http:\u002F\u002Fbooks.google.com\u002Fbooks\u002Fcontent?id=ONIfAQAAIAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",["Date","1999-01-01T00:00:00.000Z"],["Date","2023-03-06T08:50:40.813Z"],[166],{"id":158,"bookId":158,"authorId":167,"author":168},30,{"id":167,"name":169,"dateCreated":170},"Arthur Charles Clarke",["Date","2023-03-06T08:50:40.805Z"],[172],{"id":158,"bookId":158,"bookCategoryId":18,"bookCategory":173},{"id":18,"category":20,"dateCreated":174},["Date","2022-12-26T23:26:00.906Z"],{"id":176,"title":177,"subtitle":92,"description":178,"thumbnail":179,"publishedDate":180,"dateCreated":181,"authors":182,"categories":188},43,"Kagen the Damned","Kagen the Damned marks the first installment of an exciting new series of dark epic fantasy novels from bestselling author Jonathan Maberry. Sworn by Oath Kagen Vale is the trusted and feared captain of the palace guard, charged with protection of the royal children of the Silver Empire. But one night, Kagen is drugged and the entire imperial family is killed, leaving the empire in ruins. Abandoned by the Gods Haunted and broken, Kagen is abandoned by his gods and damned forever. He becomes a wanderer, trying to take down as many of his enemies as possible while plotting to assassinate the usurper, the deadly Witch-king of Hakkia. While all around him magic—long banished from the world—returns in strange and terrifying ways. Fueled by Rage To exact his vengeance, Kagen must venture into strange lands, battle bizarre and terrifying creatures, and gather allies for a suicide mission into the heart of the Witch-king’s empire. Kings and gods will fear him. Kagen the Damned","http:\u002F\u002Fbooks.google.com\u002Fbooks\u002Fcontent?id=l7U9EAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",["Date","2022-05-10T00:00:00.000Z"],["Date","2023-04-04T05:25:54.053Z"],[183],{"id":176,"bookId":176,"authorId":184,"author":185},31,{"id":184,"name":186,"dateCreated":187},"Jonathan Maberry",["Date","2023-04-04T05:25:54.037Z"],[189],{"id":176,"bookId":176,"bookCategoryId":18,"bookCategory":190},{"id":18,"category":20,"dateCreated":191},["Date","2022-12-26T23:26:00.906Z"],[193,199],{"id":18,"name":194,"value":195,"valueRendered":196,"dateCreated":197,"dateUpdated":198},"currently-reading","I'm currently reading [Son of the Poison Rose by Jonathan Mayberry](https:\u002F\u002Fwww.google.com\u002Fbooks\u002Fedition\u002FSon_of_the_Poison_Rose\u002FIldrEAAAQBAJ?hl=en&gbpv=1&dq=kagen+the+damned&printsec=frontcover), [Before the Coffee Gets Cold by Toshikazu Kawaguchi](https:\u002F\u002Fwww.amazon.com\u002FBefore-the-Coffee-Gets-Cold\u002Fdp\u002F1529029589) and [Thinking in Systems: A Primer by Donella Meadows](https:\u002F\u002Fwww.amazon.ca\u002FThinking-Systems-Primer-Donella-Meadows\u002Fdp\u002F1603580557\u002Fref=asc_df_1603580557\u002F?tag=googleshopc0c-20&linkCode=df0&hvadid=292983223404&hvpos=&hvnetw=g&hvrand=9379528582674499852&hvpone=&hvptwo=&hvqmt=&hvdev=c&hvdvcmdl=&hvlocint=&hvlocphy=9001493&hvtargid=pla-433972195186&psc=1) ","\u003Cp\u003EI&#39;m currently reading \u003Ca href=\"https:\u002F\u002Fwww.google.com\u002Fbooks\u002Fedition\u002FSon_of_the_Poison_Rose\u002FIldrEAAAQBAJ?hl=en&gbpv=1&dq=kagen+the+damned&printsec=frontcover\"\u003ESon of the Poison Rose by Jonathan Mayberry\u003C\u002Fa\u003E, \u003Ca href=\"https:\u002F\u002Fwww.amazon.com\u002FBefore-the-Coffee-Gets-Cold\u002Fdp\u002F1529029589\"\u003EBefore the Coffee Gets Cold by Toshikazu Kawaguchi\u003C\u002Fa\u003E and \u003Ca href=\"https:\u002F\u002Fwww.amazon.ca\u002FThinking-Systems-Primer-Donella-Meadows\u002Fdp\u002F1603580557\u002Fref=asc_df_1603580557\u002F?tag=googleshopc0c-20&linkCode=df0&hvadid=292983223404&hvpos=&hvnetw=g&hvrand=9379528582674499852&hvpone=&hvptwo=&hvqmt=&hvdev=c&hvdvcmdl=&hvlocint=&hvlocphy=9001493&hvtargid=pla-433972195186&psc=1\"\u003EThinking in Systems: A Primer by Donella Meadows\u003C\u002Fa\u003E \u003C\u002Fp\u003E\n",["Date","2023-04-04T05:27:41.284Z"],["Date","2023-04-04T05:27:41.281Z"],{"id":200,"name":201,"value":202,"valueRendered":203,"dateCreated":204,"dateUpdated":205},6,"recently-read-2022-intro","Below are some of the books I've read this year. Click on a title to read its description. Data was pulled from the Google Books API so the categorization of each book might not be 100% accurate.\n\nIn the future, I'd like to write reviews or short posts discussing each or some of the books. ","\u003Cp\u003EBelow are some of the books I&#39;ve read this year. Click on a title to read its description. Data was pulled from the Google Books API so the categorization of each book might not be 100% accurate.\u003C\u002Fp\u003E\n\u003Cp\u003EIn the future, I&#39;d like to write reviews or short posts discussing each or some of the books. \u003C\u002Fp\u003E\n",["Date","2023-01-15T07:33:03.265Z"],["Date","2023-01-15T07:33:03.264Z"]],"uses":{"params":["year"]}}]}